# OLTP vs OLAP

# Storing Data

In [ ]:
# Unstructured data: zip file of all text messages
# Semi structured data: CSV of open government data
# Structured data: relational database of customers purchases

In [1]:
# ETL
    #raw data is cleaned before being stored. This makes it accessible and ready to use.

# When should you choose a data warehouse over a data lake?
    # To create accessible and isolated data repositories for other analysts

# Database design

In [ ]:
# Conceptual Data Model

# Logical Data Model

# Physical Data Model

In [ ]:
# Create a route dimension table
CREATE TABLE route (
	route_id INTEGER PRIMARY KEY,
    park_name VARCHAR(160) NOT NULL,
    city_name VARCHAR(160) NOT NULL,
    distance_km FLOAT NOT NULL,
    route_name VARCHAR(160) NOT NULL
);
# Create a week dimension table
CREATE TABLE week(
	week_id INTEGER PRIMARY KEY,
    week INTEGER NOT NULL,
    month VARCHAR(160) NOT NULL,
    year INTEGER NOT NULL
);

In [ ]:
SELECT 
	# Get the total duration of all runs
	SUM(duration_mins)
FROM 
	runs_fact
# Get all the week_id's that are from July, 2019
INNER JOIN week_dim ON runs_fact.week_id = week_dim.week_id
WHERE month = 'July' and year = '2019';

# Star and snowflake schema

In [ ]:
# Add the book_id foreign key
ALTER TABLE fact_booksales ADD CONSTRAINT sales_book
    FOREIGN KEY (book_id) REFERENCES dim_book_star (book_id);
    
# Add the time_id foreign key
ALTER TABLE fact_booksales ADD CONSTRAINT sales_time
   FOREIGN KEY (time_id) REFERENCES dim_time_star (time_id);
    
# Add the store_id foreign key
ALTER TABLE fact_booksales ADD CONSTRAINT sales_store
   FOREIGN KEY (store_id) REFERENCES dim_store_star (store_id);

In [ ]:
# Create a new table for dim_author with an author column
CREATE TABLE dim_author (
    author varchar(256)  NOT NULL
);

# Insert authors 
INSERT INTO dim_author
SELECT DISTINCT author FROM dim_book_star;

# Add a primary key 
ALTER TABLE dim_author ADD COLUMN author_id SERIAL PRIMARY KEY;

# Output the new table
SELECT * FROM dim_author;

# Normalized and denormalized databases

In [ ]:
# Output each state and their total sales_amount
SELECT dim_store_star.state, sum(sales_amount)
FROM fact_booksales
	# Join to get book information
    JOIN dim_book_star on fact_booksales.book_id = dim_book_star.book_id
	# Join to get store information
    JOIN dim_store_star on fact_booksales.store_id= dim_store_star.store_id
# Get all books with in the novel genre
WHERE  
    genre= 'novel'
# Group results by state
GROUP BY
    state

In [ ]:
# Output each state and their total sales_amount
SELECT dim_state_sf.state, sum(sales_amount)
FROM fact_booksales
    # Joins for genre
    JOIN dim_book_sf on fact_booksales.book_id = dim_book_sf.book_id
    JOIN dim_genre_sf on dim_book_sf.genre_id = dim_genre_sf.genre_id
    # Joins for state
    JOIN dim_store_sf on fact_booksales.store_id = dim_store_sf.store_id 
    JOIN dim_city_sf on dim_store_sf.city_id = dim_city_sf.city_id
	JOIN dim_state_sf on  dim_city_sf.state_id = dim_state_sf.state_id
# Get all books with in the novel genre and group the results by state
WHERE  
    dim_genre_sf.genre = 'novel'
GROUP BY
    dim_state_sf.state;

In [ ]:
# Add a continent_id column with default value of 1
ALTER TABLE dim_country_sf
ADD COLUMN continent_id int NOT NULL DEFAULT(1);

# Add the foreign key constraint
ALTER TABLE dim_country_sf ADD CONSTRAINT country_continent
   FOREIGN KEY (continent_id) REFERENCES dim_continent_sf(continent_id);
   
# OUTput updated table
SELECT * FROM dim_country_sf;

# Normal Forms

In [ ]:
1NF = can not have two values in same column

In [ ]:
# Create a new table to hold the cars rented by customers
CREATE TABLE cust_rentals (
  customer_id INT NOT NULL,
  car_id VARCHAR(128) NULL,
  invoice_id VARCHAR(128) NULL
);

# Drop column from customers table to satisfy 1NF
ALTER TABLE customers
DROP COLUMN cars_rented,
DROP COLUMN invoice_id;

In [ ]:
# 2NF
# Create a new table to satisfy 2NF
CREATE TABLE cars (
  car_id VARCHAR(256) NULL,
  model VARCHAR(128),
  manufacturer VARCHAR(128),
  type_car VARCHAR(128),
  condition VARCHAR(128),
  color VARCHAR(128)
);

# Drop columns in customer_rentals to satisfy 2NF
ALTER TABLE customer_rentals
DROP COLUMN car_id,
DROP COLUMN model, 
DROP COLUMN type_car,
DROP COLUMN condition,
DROP COLUMN color;

In [ ]:
# 3NF

# Create a new table to satisfy 3NF
CREATE TABLE car_model(
  model VARCHAR(128),
  manufacturer VARCHAR(128),
  type_car VARCHAR(128)
);

# Drop columns in rental_cars to satisfy 3NF
ALTER TABLE rental_cars
DROP COLUMN manufacturer, 
DROP COLUMN type_car;

# Database views

In [ ]:
# Get all non-systems views
SELECT * FROM information_schema.views
WHERE table_schema NOT IN ('pg_catalog', 'information_schema');

In [ ]:
# Create a view for reviews with a score above 9
CREATE VIEW high_scores AS
SELECT * FROM REVIEWS
WHERE score > 9;

# Create a view for reviews with a score above 9
CREATE VIEW high_scores AS
SELECT * FROM REVIEWS
WHERE score > 9;

# Count the number of self-released works in high_scores
SELECT COUNT(*) FROM high_scores
INNER JOIN labels ON high_scores.reviewid = labels.reviewid
WHERE label = 'self-released'

# Managing views

In [ ]:
# Create a view with the top artists in 2017
CREATE VIEW top_artists_2017 AS
# with only one column holding the artist field
SELECT artist_title.artist FROM artist_title
INNER JOIN top_15_2017
ON artist_title.reviewid = top_15_2017.reviewid;

# Output the new view
SELECT * FROM top_artists_2017;

# Which is the DROP command that would drop both top_15_2017 and top_artists_2017?
DROP VIEW top_15_2017 CASCADE;

In [ ]:
REVOKE UPDATE, INSERT on table_name FROM public
GRANT UPDATE, INSERT on table_name to editor

# Revoke everyone's update and insert privileges
REVOKE UPDATE, INSERT ON long_reviews FROM PUBLIC; 

# Grant editor update and insert privileges 
GRANT UPDATE, INSERT ON long_reviews TO editor;

In [ ]:
#` Redefine the artist_title view to have a label column
CREATE OR REPLACE VIEW artist_title AS
SELECT reviews.reviewid, reviews.title, artists.artist, labels.label
FROM reviews
INNER JOIN artists
ON artists.reviewid = reviews.reviewid
INNER JOIN labels
ON artists.reviewid = labels.reviewid;

SELECT * FROM artist_title;

# Materialized views

In [ ]:
# Non-Materialized
# always returns up to date data, better on write-intestive database

# Non-Materialized and Materialized Views
# helps reduce overhead of writing queries and Can be used in data warehouse

# Materialized views
# consumes more storage, stores query result on disk

In [ ]:
# Create a materialized view called genre_count 
CREATE MATERIALIZED VIEW genre_count AS
SELECT genre, COUNT(*) 
FROM genres
GROUP BY genre;

INSERT INTO genres
VALUES (50000, 'classical');

# Refresh genre_count
REFRESH MATERIALIZED VIEW genre_count;

SELECT * FROM genre_count;

# Data base roles and access control

In [ ]:
# Create a data scientist role
CREATE ROLE data_scientist;

# Create a role for Marta
CREATE ROLE Marta LOGIN;

# Create an admin role
CREATE ROLE admin WITH CREATEDB CREATEROLE;

In [ ]:
# Grant data_scientist update and insert privileges
GRANT UPDATE, INSERT ON long_reviews TO data_scientists;

# Give Marta's role a password
ALTER ROLE Martha WITH PASSWORD 's3cur3p@ssw0rd'

In [ ]:
# Add Marta to the data scientist group
GRANT data_scientist TO Marta

#Remove Marta from data scientist
REVOKE data_scientist FROM Marta

# Table partitioning

In [ ]:
# Create a new table called film_descriptions
CREATE TABLE film_descriptions (
    film_id INT,
    long_description TEXT
);

# Copy the descriptions from the film table
INSERT INTO film_descriptions
SELECT film_id, long_description FROM film;
    
# Drop the descriptions from the original table
ALTER TABLE film DROP COLUMN long_description;

# Join to view the original table
SELECT * FROM film_descriptions 
JOIN film USING(film_id);

In [ ]:
# Create a new table called film_partitioned
CREATE TABLE film_partitioned (
  film_id INT,
  title TEXT NOT NULL,
  release_year TEXT
)
PARTITION BY LIST (release_year);

# Create the partitions for 2019, 2018, and 2017
CREATE TABLE film_2019
	PARTITION OF film_partitioned FOR VALUES IN ('2019');

CREATE TABLE film_2018
	PARTITION OF film_partitioned FOR VALUES IN ('2018');

CREATE TABLE film_2017
	PARTITION OF film_partitioned FOR VALUES IN ('2017');

# Insert the data into film_partitioned
INSERT INTO film_partitioned
SELECT film_id, title, release_year FROM film;

# View film_partitioned
SELECT * FROM film_partitioned;

# Data integration

# Picking a Database Management System (DBMS)